frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->save();
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('jurikaca', 'juri.kaca@gmail.com', '$2y$13$1RK3IXsTQbs9EHt5IanPVOj3ogO5IiY4xO1i2TtyYqK9qZISwNYuW', 'Yo7xBU-3qWiFC4P3Vt5jUZFmg-o1s3Dm', 10, 1511386320, 1511386320)